{
    "input_text": [
        "Question: What is International Molecular Exchange Consortium? Context: (Wikipedia article: 'International Molecular Exchange Consortium')",
        "Question: What is Integrated Facilities Program? Context: (Wikipedia article: 'Integrated development environment')",
        "Question: What is Electrical Safety? Context: (Wikipedia article: 'Electrical safety testing')",
        "Question: What is Life Cycle Asset Management? Context: (Wikipedia article: 'Infrastructure asset management')",
        "Question: What is Capital Planning? Context: (Wikipedia article: 'Capital budgeting')",
        "Question: What is OpU Engineering? Context: (Wikipedia article: 'Osaka Metropolitan University')",
        "Question: What is Legacy Sites? Context: (Wikipedia article: 'List of World Heritage Sites in South Africa')",
        "Question: What is Business Operation? Context: (Wikipedia article: 'Business administration')",
        "Question: What is Innovation? Context: (Wikipedia article: 'Innovation')",
        "Question: What is Network Strategy? Context: (Wikipedia article: 'Strategy')",
        "Question: What is Business Development Engineering? Context: (Wikipedia article: 'Software development process')",
        "Question: What is Capital Projects? Context: (Wikipedia article: 'Natural Capital Project')",
        "Question: What is Data Tools for Making Medicines? Context: (Wikipedia article: 'Digital medicine')",
        "Question: What is Utilities Optimization? Context: (Wikipedia article: 'Mathematical optimization')",
        "Question: What is Compliance & Electrical Safety? Context: (Wikipedia article: 'Regulatory Compliance Mark')",
        "Question: What is Net Zero Strategic Initiative? Context: (Wikipedia article: 'United Nations Environment Programme Finance Initiative')"
    ],
    "target_text": [
        "The International Molecular Exchange Consortium (IMEx) is a group of the major public providers of molecular interaction data to provide a single, non-redundant set of molecular interactions. Data is captured using a detailed curation model and made available in the PSI-MI standard formats. Participating databases include DIP, IntAct, the Molecular Interaction Database (MINT), MatrixDB, InnateDB, IID, HPIDB, UCL Cardiovascular Gene Annotation, MBInfo, Molecular Connections and UniProt. The group collates the interaction data and prevents duplicate entries in the various databases. The IMEx consortium also supports and contributes to the development of the HUPO-PSI-MI XML format, which is now widely implemented.\n\n",
        "An integrated development environment (IDE) is a software application that provides comprehensive facilities for software development. An IDE normally consists of at least a source-code editor, build automation tools, and a debugger. Some IDEs, such as IntelliJ IDEA, Eclipse and Lazarus contain the necessary compiler, interpreter or both; others, such as SharpDevelop and NetBeans, do not.\nThe boundary between an IDE and other parts of the broader software development environment is not well-defined; sometimes a version control system or various tools to simplify the construction of a graphical user interface (GUI) are integrated. Many modern IDEs also have a class browser, an object browser, and a class hierarchy diagram for use in object-oriented software development.\n\n",
        "In electrical engineering, electrical safety testing is essential to make sure electrical products and installations are safe. To meet this goal, governments and various technical bodies have developed electrical safety standards. All countries have their own electrical safety standards that must be complied with. To meet to these standards, electrical products and installations must pass electrical safety tests.\nSome types of electrical safety tests include: \n\ndielectric withstand test (also called a hipot test)\ninsulation resistance test (IR test)\nearth continuity test\nleakage current test\nElectrical safety tests are described in various national and international standards.",
        "Infrastructure asset management is the integrated, multidisciplinary set of strategies in sustaining public infrastructure assets such as water treatment facilities, sewer lines, roads, utility grids, bridges, and railways. Generally, the process focuses on the later stages of a facility's life cycle, specifically maintenance, rehabilitation, and replacement. Asset management specifically uses software tools to organize and implement these strategies with the fundamental goal to preserve and extend the service life of long-term infrastructure assets which are vital underlying components in maintaining the quality of life in society and efficiency in the economy. In the 21st century, climate change adaptation has become an important part of infrastructure asset management competence.",
        "Capital budgeting in corporate finance, corporate planning and accounting is an area of capital management that concerns the planning process used to determine whether an organization's long term capital investments such as new machinery, replacement of machinery, new plants, new products, and research  development projects are worth the funding of cash through the firm's capitalization structures (debt, equity or retained earnings). It is the process of allocating resources for major capital, or investment, expenditures.  \nAn underlying goal, consistent with the overall approach in corporate finance, is to increase the value of the firm to the shareholders. \nCapital budgeting is typically considered a non-core business activity as it is not part of the revenue model or models of most types of firms, or even a part of daily operations. It holds a strategic financial function within a business. One example of a firm type where capital budgeting is possibly a part of the core business activities is with investment banks, as their revenue model or models rely on financial strategy to a considerable degree.\nFor the budget allocated to ongoing expenses and revenue, see operating budget.",
        "Osaka Metropolitan University (大阪公立大学, Ōsaka kōritsu daigaku), abbreviated to OMU, is a Japanese public university that was established through the integration of Osaka City University (OCU) and Osaka Prefecture University (OPU) on 1 April 2022.\nOMU was inaugurated with 1 undergraduate college, 11 undergraduate schools and 15 graduate schools. With the integration of the two universities, the number of students amounts to about 16,000, which is the largest scale in Japan as a public university. In addition, OMU's number of new first-year students per year is 2,853, placing it in third place among Japanese national/public universities, after Osaka University and the University of Tokyo.",
        "The United Nations Educational, Scientific and Cultural Organization (UNESCO) World Heritage Sites are places of importance to cultural or natural heritage as described in the UNESCO World Heritage Convention, established in 1972. Cultural heritage consists of monuments (such as architectural works, monumental sculptures, or inscriptions), groups of buildings, and sites (including archaeological sites). Natural features (consisting of physical and biological formations), geological and physiographical formations (including habitats of threatened species of animals and plants), and natural sites which are important from the point of view of science, conservation, or natural beauty, are defined as natural heritage. South Africa accepted the convention on 10 July 1997. There are twelve World Heritage Sites in South Africa.\nThe first three sites in South Africa were added to the list in 1999 while the most recent ones, the Nelson Mandela Legacy Sites and the Pleistocene Occupation Sites of South Africa, were added in 2024. Seven sites are listed for their cultural significance, four for natural, and one site, the Maloti-Drakensberg Park, is listed for both. This site is transnational as it is shared with Lesotho. South Africa has served as a member of the World Heritage Committee three times: 1999–2005, 2009–2013, and 2019–2023.",
        "Business administration is the administration of a commercial enterprise. It includes all aspects of overseeing and supervising the business operations of an organization.\n\n",
        "Innovation is the practical implementation of ideas that result in the introduction of new goods or services or improvement in offering goods or services. ISO TC 279 in the standard ISO 56000:2020 defines innovation as \"a new or changed entity, realizing or redistributing value\". Others have different definitions; a common element in the definitions is a focus on newness, improvement, and spread of ideas or technologies.\nInnovation often takes place through the development of more-effective products, processes, services, technologies, art works\nor business models that innovators make available to markets, governments and society.\nInnovation is related to, but not the same as, invention: innovation is more apt to involve the practical implementation of an invention (i.e. new / improved ability) to make a meaningful impact in a market or society, and not all innovations require a new invention.\nTechnical innovation often manifests itself via the engineering process when the problem being solved is of a technical or scientific nature. The opposite of innovation is exnovation.",
        "Strategy (from Greek στρατηγία stratēgia, \"troop leadership; office of general, command, generalship\") is a general plan to achieve one or more long-term or overall goals under conditions of uncertainty. In the sense of the \"art of the general\", which included several subsets of skills including military tactics, siegecraft, logistics etc., the term came into use in the 6th century C.E. in Eastern Roman terminology, and was translated into Western vernacular languages only in the 18th century. From then until the 20th century, the word \"strategy\" came to denote \"a comprehensive way to try to pursue political ends, including the threat or actual use of force, in a dialectic of wills\" in a military conflict, in which both adversaries interact.\nStrategy is important because the resources available to achieve goals are usually limited. Strategy generally involves setting goals and priorities, determining actions to achieve the goals, and mobilizing resources to execute the actions. A strategy describes how the ends (goals) will be achieved by the means (resources). Strategy can be intended or can emerge as a pattern of activity as the organization adapts to its environment or competes. It involves activities such as strategic planning and strategic thinking.\nHenry Mintzberg from McGill University defined strategy as a pattern in a stream of decisions to contrast with a view of strategy as planning,. while Max McKeown (2011) argues that \"strategy is about shaping the future\" and is the human attempt to get to \"desirable ends with available means\". Vladimir Kvint defines strategy as \"a system of finding, formulating, and developing a doctrine that will ensure long-term success if followed faithfully.\"",
        "In software engineering, a software development process or software development life cycle (SDLC) is a process of planning and managing software development. It typically involves dividing software development work into smaller, parallel, or sequential steps or sub-processes to improve design and/or product management. The methodology may include the pre-definition of specific deliverables and artifacts that are created and completed by a project team to develop or maintain an application.\nMost modern development processes can be vaguely described as agile. Other methodologies include waterfall, prototyping, iterative and incremental development, spiral development, rapid application development, and extreme programming.\nA life-cycle \"model\" is sometimes considered a more general term for a category of methodologies and a software development \"process\" is a particular instance as adopted by a specific organization. For example, many specific software development processes fit the spiral life-cycle model. The field is often considered a subset of the systems development life cycle.\n\n",
        "The Natural Capital Project (NatCap) is a partnership among 250 groups around the world that has developed a systematic approach to weighing nature’s benefits. By placing a value on nature in the context of resource allocation, NatCap is influencing policy, finance and management decisions worldwide.\nNatCap is led from a global hub at Stanford University in collaboration with The Nature Conservancy, World Wildlife Fund, the Institute on the Environment of the University of Minnesota, the Stockholm Resilience Centre, and the Chinese Academy of Sciences. It was launched in 2005.\nNatCap engages leaders in governments, corporations, universities and other non-profit organizations, and melds its research with initiatives that benefit both nature and the economy. Nature's value is measured in terms of specific benefits, such as human health, economic development, food security and culture.  While NatCap's approach has garnered broad support, not everyone agrees with the methodology of putting a monetary value on nature.\nThe Natural Capital Project has developed a free, open-source software tool called InVEST (Integrated Valuation of Ecosystem Services and Trade-offs). It allows farmers, landowners and government officials to make better-informed decisions about the current and future costs of an activity. InVEST is used in more than 185 countries to map and model valuable ecological resources, assess trade-offs in land- and water-use, and integrate both conservation and human development into investments.",
        "Digital medicine refers to the application of advanced digital technologies, such as artificial intelligence, machine learning, and big data analytics, to improve patient outcomes and healthcare delivery. It involves the integration of technology and medicine to facilitate the creation, storage, analysis, and dissemination of biological  and medical insights, with the aim of enhancing fundamental understandings of biology, clinical decision-making, improving patient care, and reducing costs. It has seen recent growth with the addition of multiple data types for this purpose (multi-omic data). \nDigital medicine encompasses a wide range of disciplines, including techbio, healthtech, and biomedical engineering. It involves the use of digital tools and platforms to collect, store, and analyze medical and biological data, including electronic health records, genomic data, and medical imaging. This data can then be used to develop new analytics and treatment approaches, personalize healthcare interventions, and optimize healthcare delivery.\nDigital medicine is evidence-based, and its approach is rooted in rigorous scientific research and clinical evidence. It is designed to augment and complement traditional medical practices, providing physicians and other healthcare professionals with the tools and resources they need to make more informed decisions and provide better care to patients.",
        "Mathematical optimization (alternatively spelled optimisation) or mathematical programming is the selection of a best element, with regard to some criteria, from some set of available alternatives. It is generally divided into two subfields: discrete optimization and continuous optimization. Optimization problems arise in all quantitative disciplines from computer science and engineering to operations research and economics, and the development of solution methods has been of interest in mathematics for centuries.\nIn the more general approach, an optimization problem consists of maximizing or minimizing a real function by systematically choosing input values from within an allowed set and computing the value of the function. The generalization of optimization theory and techniques to other formulations constitutes a large area of applied mathematics.",
        "The Regulatory Compliance Mark (RCM) is a trademarked symbol that denotes a claim that a product is safe for use in Australia and New Zealand because it satisfies applicable regulatory requirements. These requirements comprise both the requirements under the Electrical Equipment Safety System (EESS) and the Australian Communications & Media Authority (ACMA) requirements for EMC, EME, and telecommunications and wireless devices. As of May 2024, the EESS regulates the safety of household electrical equipment in the Australian states of Queensland, Victoria, Western Australia and Tasmania.\nOwned by the Electrical Regulatory Authorities Council (ERAC) – the peak body of electrical safety regulators in Australia and New Zealand – and the ACMA, RCM use is defined by AS/NZS 4417. On 1 March 2016, the RCM became mandatory and replaced ACMA's A-tick and C-tick marks. Similar to the CE mark, the RCM is not a quality indicator nor a certification mark.",
        "The United Nations Environment Programme Finance Initiative (UNEP FI) is a partnership between the United Nations Environment Program (UNEP) and the global financial sector to catalyse action across the financial system to align economies with sustainable development. As the UN partner for the finance sector, they convene financial institutions on a voluntary basis to work together with them, and each other, to find practical solutions to overcome the many sustainability challenges facing the world today. UNEP FI does this by providing practical guidance and tools which support institutions in the finance sector to find ways to reshape their businesses and commit to targets for limiting greenhouse gas emissions, protecting nature, promoting a circular economy and supporting financial inclusion to address inequality. The solutions developed effectively form a blueprint for others in the finance sector to tackle similar challenges and evolve their businesses along a sustainable pathway. The creation and adoption of such a blueprint also informs policy makers concerned with sustainability issues about what would constitute appropriate regulation for the finance sector at large. Founded in 1992, UNEP FI was the first organisation to pioneer engagement with the finance sector around sustainability. The Finance Initiative was responsible for incubating the Principles for Responsible Investment and for the development and implementation of UNEP FI's Principles for Responsible Banking and Principles for Sustainable Insurance as well as the UN-convened net-zero alliances. Today, UNEP FI provides sustainability leadership to more than 400 financial institutions, with assets of well over $80 trillion headquartered around the world."
    ]
}